---
kind: property
id: P:Autodesk.Revit.DB.FabricationServiceButton.PaletteIndex
source: html/e029f3da-cf97-dc5d-3820-ecb6cc30815f.htm
---
# Autodesk.Revit.DB.FabricationServiceButton.PaletteIndex Property

The palette index for this button.

## Syntax (C#)
```csharp
public int PaletteIndex { get; }
```